# Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [102]:
#check if notebook runs in colab
import sys
IN_COLAB = 'google.colab' in sys.modules
print('running in Colab:',IN_COLAB)
path='..'
if IN_COLAB:
  #in colab, we need to clone the data from the repo
  !git clone https://github.com/keuperj/DataScienceSS20.git
  path='DataScienceSS20'

running in Colab: False

In [103]:
import pandas as pd

### Step 2. 
User ***Jupyter Lab*** to view ``path+"/DATA/US_Baby_Names_right.csv"``.

### Step 3. Assign it to a variable called baby_names.

In [104]:
baby_names = pd.read_csv(path+'/DATA/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [105]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [106]:
baby_names.drop(columns=['Unnamed: 0', 'Id'])

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Are there more male or female names in the dataset?

In [107]:
print(baby_names[baby_names['Gender'] == "F"].count())
print(baby_names[baby_names['Gender'] == "M"].count())

#Mehr female babys

Unnamed: 0    558846
Id            558846
Name          558846
Year          558846
Gender        558846
State         558846
Count         558846
dtype: int64
Unnamed: 0    457549
Id            457549
Name          457549
Year          457549
Gender        457549
State         457549
Count         457549
dtype: int64

### Step 7. Group the dataset by name and assign to names

In [108]:
names = baby_names.groupby("Name")

names.get_group('Martin')

         Unnamed: 0       Id    Name  Year Gender State  Count
3030          24702    24703  Martin  2006      M    AK      5
3225          24897    24898  Martin  2007      M    AK      6
15141        145310   145311  Martin  2004      M    AL     17
15830        145999   146000  Martin  2005      M    AL     18
16636        146805   146806  Martin  2006      M    AL     14
...             ...      ...     ...   ...    ...   ...    ...
1001103     5542829  5542830  Martin  2010      M    WI     17
1001944     5543670  5543671  Martin  2011      M    WI     18
1002810     5544536  5544537  Martin  2012      M    WI     16
1003726     5545452  5545453  Martin  2013      M    WI     12
1004510     5546236  5546237  Martin  2014      M    WI     16

[425 rows x 7 columns]

### Step 8. How many different names exist in the dataset?

In [109]:
names.count().count()

#Answer: 17632

Unnamed: 0    17632
Id            17632
Year          17632
Gender        17632
State         17632
Count         17632
dtype: int64

### Step 9. What is the name with most occurrences?

In [133]:
#names.count().sort_values('Count', ascending=False)
names.count()["Count"].median()
#Answer: 1112 Rileys

8.0

### Step 10. How many different names have the least occurrences?

In [132]:
print(names.count()[names.count()["Count"] == names.count()["Count"].min()].count())

Unnamed: 0    3682
Id            3682
Year          3682
Gender        3682
State         3682
Count         3682
dtype: int64

### Step 11. What is the median name occurrence?

In [134]:
print(names.count()[names.count()["Count"] == names.count()["Count"].median()].count())

Unnamed: 0    360
Id            360
Year          360
Gender        360
State         360
Count         360
dtype: int64

### Step 12. What is the standard deviation of names?

In [137]:
names.count()["Count"].std()

122.02996350814125

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [140]:
names.count().describe()

,Unnamed: 0,Id,Year,Gender,State,Count
count,17632.000000,17632.000000,17632.000000,17632.000000,17632.000000,17632.000000
mean,57.644907,57.644907,57.644907,57.644907,57.644907,57.644907
std,122.029964,122.029964,122.029964,122.029964,122.029964,122.029964
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000
50%,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000
75%,39.000000,39.000000,39.000000,39.000000,39.000000,39.000000
max,1112.000000,1112.000000,1112.000000,1112.000000,1112.000000,1112.000000